Autodesk.Revit.DB.Structure.PathReinforcement.RemovePathReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.PathReinforcement)
Deletes the specified PathReinforcement, and converts its RebarInSystem
elements to equivalent Rebar elements.
doc:
The document.
system:
A PathReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document doc does not contain the element system
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.PathReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},System.Boolean,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new PathReinforcement object from an array of curves.
This method replaces the NewPathReinforcement method, which has been deprecated.
document:
The document.
hostElement:
The element that will host the PathReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the PathReinforcement.
flip:
A flag controlling the bars relative to the curves.
pathReinforcementTypeId:
The id of the PathReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
startRebarHookTypeId:
The id of the RebarHookType for the start of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no start hook.
endRebarHookTypeId:
The id of the RebarHookType for the end of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no end hook.
Returns:
The newly created PathReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The document document does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
curves in curveArray are not continuous and open.
-or-
pathReinforcementTypeId should refer to an PathReinforcementType element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
startRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
endRebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.PathReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},System.Boolean)
Creates a new PathReinforcement object from an array of curves.
document:
The document.
hostElement:
The element that will host the PathReinforcement. The host can be either a Structural Floor or Structural Wall.
curveArray:
An array of curves that will define the outline of the PathReinforcement.
flip:
A flag controlling the bars relative to the curves.
Returns:
The newly created PathReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The document document does not contain the element hostElement
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
curves in curveArray are not continuous and open.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2014

Autodesk.Revit.DB.Structure.PathReinforcement.AdditionalOffset
Additional offset
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.PathReinforcement
An object that represents an Path Reinforcement within the Autodesk Revit project.
Remarks:
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.
The Path Reinforcement element is available only in the Autodesk Revit Structure product.